cases/cavity/0.org/ArtificialFluid.continuous
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ArtificialFluid.continuous;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           $internalField;
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}
