cases/cavity/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      sampleDict;
}

type sets;
libs ("libsampling.so");

setFormat raw;

interpolationScheme cellPoint;

fields
(
    U
);

sets
(
    Y
    {
        type        uniform;
        axis        distance;

        start       (0 0 0);
        end         (0 1 0);

        nPoints     256;
    }

    X
    {
        type        uniform;
        axis        distance;

        start       (-0.5 0.5 0);
        end         (0.5 0.5 0);

        nPoints     256;
    }
);
